---
kind: type
id: T:Autodesk.Revit.DB.ViewDetailLevel
source: html/1f75aa53-ca98-df48-3286-a06b56096054.htm
---
# Autodesk.Revit.DB.ViewDetailLevel

Detail level of the view

## Syntax (C#)
```csharp
public enum ViewDetailLevel
```